>## Participant
>
Tile = "Mr."

Name = "Mohammad Damoun Dahir"

email = "mohammad.damoun@gmail.com"

whatsapp = "00923335190823"
___

# Pandas Tutorial (Day-11)

This notebook explains how to install Pandas and use its various functions for data manipulation.

### 1. How to install libraries

In [240]:
#pip install pandas
#pip install numpy

### 2. How to load libraries

In [241]:
import pandas as pd
import numpy as np

### 3. Object Creation

**3a. Creating 1D Series**

In [242]:
# Creating a 1D series
s = pd.Series([1,3,5,7,8,9])
s

0    1
1    3
2    5
3    7
4    8
5    9
dtype: int64

**3b. Creating 1D Series with Empty Cell**

In [243]:
# Creating an "empty cell" in the 1D Panda Series using Numpy
s = pd.Series([1,3,np.nan,5 ,7,8,9])             #< np.nan between 5 and 7 will use Numpy library to create a NaN element in this Panda series
s

0    1.0
1    3.0
2    NaN
3    5.0
4    7.0
5    8.0
6    9.0
dtype: float64

**3c. Creating 1D Series of a specified dates**

In [244]:
dates = pd.date_range("20220821", periods=7)    #giving commmand to pd to create a date range from 21 Aug 2022 (2022/08/21)for a period of 7 days
dates

DatetimeIndex(['2022-08-21', '2022-08-22', '2022-08-23', '2022-08-24',
               '2022-08-25', '2022-08-26', '2022-08-27'],
              dtype='datetime64[ns]', freq='D')

**3d. Creating a Time based Data Frame (2D Matrix) using random data, and dates generated from 3c**

In [245]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=list("ABCD")) # where np.random.randn(ROWS,COLUMN)creates ROW=7 as we defined periods=7 from 3c 
df                                                                          # We defined dates as index and we gave 4 columns name of A,B,C, and D.

                   A         B         C         D
2022-08-21 -1.015768  0.776747 -1.457461 -1.470606
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617
2022-08-24  0.587399  0.040401 -1.261239 -0.753960
2022-08-25 -0.022128 -0.657940  1.071447 -0.551672
2022-08-26 -0.141788  0.692611 -1.796206 -0.504054
2022-08-27 -0.254634 -1.194663  1.391343 -1.131210

**3e. Creating Dataframe having 4 rows and 6 column using Dictionary{Key:Value}**

In [246]:
df2 = pd.DataFrame(
    {                                                                        #Opening Dictionary
        "A": 1.0,
        "B": pd.Timestamp("20220114"),
        "C": pd.Series(1, index=list(range(4)), dtype="float64"),
        "D": np.array([3] * 4, dtype="int64"),
        "E": pd.Categorical(["girl", "woman", "girl", "woman"]),
        "F": "female",     
    }
)

df2

     A          B    C  D      E       F
0  1.0 2022-01-14  1.0  3   girl  female
1  1.0 2022-01-14  1.0  3  woman  female
2  1.0 2022-01-14  1.0  3   girl  female
3  1.0 2022-01-14  1.0  3  woman  female

In [247]:
# To query about data type
df2.dtypes

A           float64
B    datetime64[ns]
C           float64
D             int64
E          category
F            object
dtype: object

### 4. Data query, guaging, extracting, summary, slicing, and sorting

**4a. Using .head and .tail to find the end and beinging for the dataframe**

In [248]:
df.head(2)

                   A         B         C         D
2022-08-21 -1.015768  0.776747 -1.457461 -1.470606
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306

In [249]:
df.tail(2)

                   A         B         C         D
2022-08-26 -0.141788  0.692611 -1.796206 -0.504054
2022-08-27 -0.254634 -1.194663  1.391343 -1.131210

**4b. Finding index of the dataframe - Extract Index of dataframe**

In [250]:
df.index

DatetimeIndex(['2022-08-21', '2022-08-22', '2022-08-23', '2022-08-24',
               '2022-08-25', '2022-08-26', '2022-08-27'],
              dtype='datetime64[ns]', freq='D')

In [251]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

**4c. Changing *Pandas* Dataframe into *NumPy* Array - Extract data into array**

In [252]:
df.to_numpy()

array([[-1.01576808,  0.77674745, -1.4574611 , -1.47060566],
       [ 0.18474451, -0.04206446, -1.01996535, -1.05630604],
       [-0.18564556,  0.77592348, -1.92791157, -0.77161696],
       [ 0.58739914,  0.04040125, -1.26123885, -0.75396036],
       [-0.02212823, -0.65794049,  1.07144716, -0.55167208],
       [-0.14178754,  0.69261054, -1.79620574, -0.50405407],
       [-0.25463416, -1.19466281,  1.39134264, -1.13120979]])

In [253]:
df2.to_numpy()

array([[1.0, Timestamp('2022-01-14 00:00:00'), 1.0, 3, 'girl', 'female'],
       [1.0, Timestamp('2022-01-14 00:00:00'), 1.0, 3, 'woman', 'female'],
       [1.0, Timestamp('2022-01-14 00:00:00'), 1.0, 3, 'girl', 'female'],
       [1.0, Timestamp('2022-01-14 00:00:00'), 1.0, 3, 'woman', 'female']],
      dtype=object)

**4d. Extract dataframe column heading**

In [254]:
list(df.columns)

['A', 'B', 'C', 'D']

In [255]:
list(df2.columns)

['A', 'B', 'C', 'D', 'E', 'F']

**4f. Find the Statistical Overview of data in the dataframe column**

In [256]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean  -0.121117  0.055859 -0.714285 -0.891346
std    0.487880  0.766678  1.366922  0.346139
min   -1.015768 -1.194663 -1.927912 -1.470606
25%   -0.220140 -0.350002 -1.626833 -1.093758
50%   -0.141788  0.040401 -1.261239 -0.771617
75%    0.081308  0.734267  0.025741 -0.652816
max    0.587399  0.776747  1.391343 -0.504054

In [257]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

**4g. Transpose the data set from Column to Rows and Rows to Column**

In [258]:
df.T

,2022-08-21,2022-08-22,2022-08-23,2022-08-24,2022-08-25,2022-08-26,2022-08-27
A,-1.015768,0.184745,-0.185646,0.587399,-0.022128,-0.141788,-0.254634
B,0.776747,-0.042064,0.775923,0.040401,-0.657940,0.692611,-1.194663
C,-1.457461,-1.019965,-1.927912,-1.261239,1.071447,-1.796206,1.391343
D,-1.470606,-1.056306,-0.771617,-0.753960,-0.551672,-0.504054,-1.131210

In [259]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2022-01-14 00:00:00,2022-01-14 00:00:00,2022-01-14 00:00:00,2022-01-14 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,girl,woman,girl,woman
F,female,female,female,female

**4h. Sorting Dataframe in Pandas**

In [260]:
# 1. Sorting the index
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-08-21 -1.470606 -1.457461  0.776747 -1.015768
2022-08-22 -1.056306 -1.019965 -0.042064  0.184745
2022-08-23 -0.771617 -1.927912  0.775923 -0.185646
2022-08-24 -0.753960 -1.261239  0.040401  0.587399
2022-08-25 -0.551672  1.071447 -0.657940 -0.022128
2022-08-26 -0.504054 -1.796206  0.692611 -0.141788
2022-08-27 -1.131210  1.391343 -1.194663 -0.254634

In [261]:
# 2. Sorting the Coulmn Header
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-08-27 -0.254634 -1.194663  1.391343 -1.131210
2022-08-26 -0.141788  0.692611 -1.796206 -0.504054
2022-08-25 -0.022128 -0.657940  1.071447 -0.551672
2022-08-24  0.587399  0.040401 -1.261239 -0.753960
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306
2022-08-21 -1.015768  0.776747 -1.457461 -1.470606

In [262]:
# 3. Sorting based on particular Column - in this example we selected "B"
df.sort_values(by="B", ascending=True)

                   A         B         C         D
2022-08-27 -0.254634 -1.194663  1.391343 -1.131210
2022-08-25 -0.022128 -0.657940  1.071447 -0.551672
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306
2022-08-24  0.587399  0.040401 -1.261239 -0.753960
2022-08-26 -0.141788  0.692611 -1.796206 -0.504054
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617
2022-08-21 -1.015768  0.776747 -1.457461 -1.470606

**4i. Extracting individual column data from the dataframe**

In [263]:
# Extracting only data from column C
df["C"]

2022-08-21   -1.457461
2022-08-22   -1.019965
2022-08-23   -1.927912
2022-08-24   -1.261239
2022-08-25    1.071447
2022-08-26   -1.796206
2022-08-27    1.391343
Freq: D, Name: C, dtype: float64

**4j. Extracting a particular slice of the data - row wise in Pandas**

In [264]:
df2[1:3]

     A          B    C  D      E       F
1  1.0 2022-01-14  1.0  3  woman  female
2  1.0 2022-01-14  1.0  3   girl  female

In [265]:
df[2:5]

                   A         B         C         D
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617
2022-08-24  0.587399  0.040401 -1.261239 -0.753960
2022-08-25 -0.022128 -0.657940  1.071447 -0.551672

**4k. (Cross section) Select a data range by Lables from Dataframe in Pandas**

In [266]:
df.loc[dates[0]]

A   -1.015768
B    0.776747
C   -1.457461
D   -1.470606
Name: 2022-08-21 00:00:00, dtype: float64

In [267]:
df.loc[dates[4]]

A   -0.022128
B   -0.657940
C    1.071447
D   -0.551672
Name: 2022-08-25 00:00:00, dtype: float64

In [268]:
df.loc[:,["A","C"]]                 #< ':' is representing the rows and ["A","C"] is representing selected column A and C of dataframe df

                   A         C
2022-08-21 -1.015768 -1.457461
2022-08-22  0.184745 -1.019965
2022-08-23 -0.185646 -1.927912
2022-08-24  0.587399 -1.261239
2022-08-25 -0.022128  1.071447
2022-08-26 -0.141788 -1.796206
2022-08-27 -0.254634  1.391343

>Self Experimentation - **START**

In [269]:
#Using mathimatical formula between columns of Pandas Dataframe
mathfor1 = ((df["A"]*df["C"])/df["B"])%2
mathfor1

2022-08-21    1.905951
2022-08-22    0.479624
2022-08-23    0.461267
2022-08-24    1.662682
2022-08-25    0.036036
2022-08-26    0.367710
2022-08-27    0.296555
Freq: D, dtype: float64

In [270]:
type(mathfor1)

pandas.core.series.Series

In [271]:
mathfor1.median()

0.46126741112675423

In [272]:
list(mathfor1)

[1.905950862286781,
 0.4796243911654585,
 0.46126741112675423,
 1.6626819544630003,
 0.03603552935996967,
 0.3677096716965275,
 0.29655511403243223]

>Self Experimentation - **END**

In [273]:
# extract selective index and column data. NOTE: Both are encapsulated in square bracket [] 
df.loc[["20220822","20220826"], ["A", "B"]]

                   A         B
2022-08-22  0.184745 -0.042064
2022-08-26 -0.141788  0.692611

In [274]:
#extract selective range of index and selective column data. NOTE: When you are giving a range, you dont need to use square brackets []
df.loc["20220822":"20220826", ["A", "B"]]

                   A         B
2022-08-22  0.184745 -0.042064
2022-08-23 -0.185646  0.775923
2022-08-24  0.587399  0.040401
2022-08-25 -0.022128 -0.657940
2022-08-26 -0.141788  0.692611

**4l. Extracting a single cell value of a dataframe in Pandas**

In [275]:
df.at[dates[0],"A"]                         #< Value of a cell @ 0A

-1.015768084742185

In [276]:
df.at[dates[4],"C"]                         #< Value of a cell of specified date index in column i.e. 4C

1.0714471560643368

In [277]:
df2.at[3,"E"]                               #< Value of a cell @ 3E

'woman'

**4m. iloc function in Pandas**\
iloc” in pandas is used to select rows and columns by number, in the order that they appear in the data frame.\
You can imagine that each row has a row number from 0 to the total rows (data.shape[0]) and iloc[] allows selections based on these numbers.

In [278]:
df.iloc[1:4]                                #< returns an output for range 1A:3D

                   A         B         C         D
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617
2022-08-24  0.587399  0.040401 -1.261239 -0.753960

In [279]:
df.iloc[1:5,0:4]                                #< returns an output for range 1A:4D

                   A         B         C         D
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617
2022-08-24  0.587399  0.040401 -1.261239 -0.753960
2022-08-25 -0.022128 -0.657940  1.071447 -0.551672

In [280]:
df.iloc[:,[1,3]]                                #< returns an output for selected column for an entire index

                   B         D
2022-08-21  0.776747 -1.470606
2022-08-22 -0.042064 -1.056306
2022-08-23  0.775923 -0.771617
2022-08-24  0.040401 -0.753960
2022-08-25 -0.657940 -0.551672
2022-08-26  0.692611 -0.504054
2022-08-27 -1.194663 -1.131210

In [281]:
df.iloc[:,1:3]                                  #< returns an output for range of selected column for an entire index

                   B         C
2022-08-21  0.776747 -1.457461
2022-08-22 -0.042064 -1.019965
2022-08-23  0.775923 -1.927912
2022-08-24  0.040401 -1.261239
2022-08-25 -0.657940  1.071447
2022-08-26  0.692611 -1.796206
2022-08-27 -1.194663  1.391343

### 5. Usage of Boolean operators in Pandas Dataframe for SELECTION or FILTRATION

In [282]:
# Extracting data using boolean

df[df["A"]>0]                                   #< this will return with selection of data set based on sorting out coulmn A with value > 0

                   A         B         C         D
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306
2022-08-24  0.587399  0.040401 -1.261239 -0.753960

In [283]:
# Another example which will show only data elements who's values are more than 0
df[df>0]

                   A         B         C   D
2022-08-21       NaN  0.776747       NaN NaN
2022-08-22  0.184745       NaN       NaN NaN
2022-08-23       NaN  0.775923       NaN NaN
2022-08-24  0.587399  0.040401       NaN NaN
2022-08-25       NaN       NaN  1.071447 NaN
2022-08-26       NaN  0.692611       NaN NaN
2022-08-27       NaN       NaN  1.391343 NaN

### 5. "Is In" Method - Appending new column of data in an existing dataframe

In [284]:
#Creating a copy of df as df3
df3 = df.copy()

In [285]:
#Adding a new column to df3
df3["E"] = ["one", "one", "two", "three", "four", "three","zero"]
df3

                   A         B         C         D      E
2022-08-21 -1.015768  0.776747 -1.457461 -1.470606    one
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306    one
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617    two
2022-08-24  0.587399  0.040401 -1.261239 -0.753960  three
2022-08-25 -0.022128 -0.657940  1.071447 -0.551672   four
2022-08-26 -0.141788  0.692611 -1.796206 -0.504054  three
2022-08-27 -0.254634 -1.194663  1.391343 -1.131210   zero

> Exercise - **Creating Average of Column A, B, C, and D and then Append it at the end of the df3 data frame**

In [288]:
# Calculating average/mean of A, B, C, and D
avABCD = df3[["A", "B","C","D"]].mean(axis=1)
avABCD

2022-08-21   -0.791772
2022-08-22   -0.483398
2022-08-23   -0.527313
2022-08-24   -0.346850
2022-08-25   -0.040073
2022-08-26   -0.437359
2022-08-27   -0.297291
Freq: D, dtype: float64

In [289]:
df3["AvgABCD"] = avABCD
df3

                   A         B         C         D      E   AvgABCD
2022-08-21 -1.015768  0.776747 -1.457461 -1.470606    one -0.791772
2022-08-22  0.184745 -0.042064 -1.019965 -1.056306    one -0.483398
2022-08-23 -0.185646  0.775923 -1.927912 -0.771617    two -0.527313
2022-08-24  0.587399  0.040401 -1.261239 -0.753960  three -0.346850
2022-08-25 -0.022128 -0.657940  1.071447 -0.551672   four -0.040073
2022-08-26 -0.141788  0.692611 -1.796206 -0.504054  three -0.437359
2022-08-27 -0.254634 -1.194663  1.391343 -1.131210   zero -0.297291

> Exercise - **End**